Respond to diagram suggestion
Co-authored-by: ritvikindupuri <76854702+ritvikindupuri@users.noreply.github.com>
